Repository: lf-j/Open-Source-Guides-For-The-Enterprise
Catalog: Using Open Source Code/tm/tm.tmx
Source language: en_us
Languages: ja_jp

source: During legal review, the legal counsel will need to decide on the incoming and outgoing license(s):
ja_jp: 法的レビュー時、法務専門家は、使用ライセンスと被使用ライセンスを次のように決定する必要があります。

source: Incoming licenses= Proprietary License + License A + License B + License C
ja_jp: 使用ライセンス = プロプライエタリ ライセンス + ライセンス A + ライセンス B + ライセンス C

source: Outgoing license(s) = ?
ja_jp: 被使用ライセンス = ?

source: Issues
ja_jp: 問題あり

source: If a licensing issue is found, such as mixed source code with incompatible licenses, the legal counsel will flag these issues and reassign the compliance ticket in JIRA to engineering to rework the code.
ja_jp: 互換性のないライセンスを持つソース コードの混在など、ライセンスに関する問題が見つかった場合、法務専門家は、それらの問題にフラグを付け、JIRA のコンプライアンス チケットを再度エンジニアリング担当者に割り当てて、コードを修正させます。

source: For example, legal review may uncover that closely held intellectual property has been combined with an open source code package.
ja_jp: たとえば、法的レビューにより、非公開の知的財産がオープン ソース コード パッケージと組み合わされていることが明らかになったとします。

source: Legal counsel will flag this and re-assign the compliance ticket to engineering to remove the proprietary source code from the open source component.
ja_jp: 法務専門家は、これにフラグを付け、コンプライアンス チケットを再度エンジニアリング担当者に割り当てて、オープン ソース コンポーネントからプロプライエタリ ソース コードを削除させます。

source: In the event that engineering insists on keeping the proprietary source code in the open source component, the open source executive committee (OSEC) will have to release the proprietary source code under an open source license.
ja_jp: エンジニアリング担当者がオープン ソース コンポーネントにプロプライエタリ ソース コードを保持することを主張する場合、オープン ソース執行委員会 (OSEC) は、オープン ソース ライセンスの下でプロプライエタリ ソース コードをリリースする必要があります。

source: Unclear
ja_jp: 不明

source: In some cases, if the licensing information is not clear or if it is not available, the legal counsel or engineering staff members contacts the project maintainer or the open source developer to clarify the ambiguities and to confirm under which license that specific software component is licensed.
ja_jp: ライセンス情報が不明確だったり、利用できない場合は、法務専門家またはエンジニアリング スタッフ メンバーがプロジェクト管理者またはオープン ソース開発者に問い合わせて、曖昧さを解決し、その特定のソフトウェア コンポーネントがどのライセンスの下にライセンスされているかを確認します。

source: Stage 4: Architecture Review
ja_jp: 第 4 段階: アーキテクチャ レビュー

source: In the architecture review, the compliance officer and an engineering representative on the auditing team or open source review board perform an analysis of the interaction between the open source, proprietary, and third-party code.
ja_jp: アーキテクチャ レビューでは、監査チームまたはオープン ソース レビュー ボードのコンプライアンス オフィサーとエンジニアリング担当者が、オープン ソース、プロプライエタリ、およびサードパーティのコード間の相互作用を分析します。

source: This is accomplished by examining an architectural diagram (see an example, below) that identifies:
ja_jp: これは、以下を示すアーキテクチャ概略図 (以下の例を参照) を調べることで実施されます。

source: ・Open source components (used “as is” or modified)
ja_jp: ・オープン ソース コンポーネント (そのまま使用、または変更)

source: ・Proprietary components
ja_jp: ・プロプライエタリ コンポーネント

source: ・Components originating from third-party software providers
ja_jp: ・サードパーティ ソフトウェア プロバイダ起源のコンポーネント

source: ・Component dependencies
ja_jp: ・コンポーネントの依存関係

source: ・Communication protocols
ja_jp: ・通信プロトコル

source: ・Other open source packages that the specific software component interacts with or depends on, especially if it is governed by a different open source license.
ja_jp: ・特に、特定のソフトウェア コンポーネントが別のオープン ソース ライセンスによって管理されている場合、そのコンポーネントがやり取りするまたは依存する、その他のオープン ソース パッケージ。

source: The result of the architecture review is an analysis of the licensing obligations that may extend from open source to proprietary or third-party software components (and across open source components as well).
ja_jp: アーキテクチャ レビューの結果として、ライセンス義務に関する分析が得られます。ライセンス義務は、オープン ソースからプロプライエタリまたはサードパーティ ソフトウェア コンポーネントに及ぶ場合があり、また、複数のオープン ソース コンポーネントにまたがって及ぶ場合もあります。

source: If the compliance officer discovers any issues, such as a proprietary software component linking to a GPL licensed component, the compliance officer forwards the compliance ticket to engineering for resolution.
ja_jp: コンプライアンス オフィサーが問題 (たとえば、GPL ライセンスされたコンポーネントにリンクしているプロプライエタリ ソフトウェア コンポーネント) を発見した場合、コンプライアンス オフィサーは解決のためにコンプライアンス チケットをエンジニアリング担当者に送ります。

source: If there are no issues, then the compliance officer moves the ticket to the final stage in the approval process.
ja_jp: 問題がない場合は、コンプライアンス オフィサーはチケットを承認プロセスの最終段階へ送ります。

source: Stage 5: Final Review
ja_jp: 第 5 段階: 最終レビュー

source: The final review is usually a face-to-face meeting of the auditing team or open source review board (OSRB) during which the team approves or rejects the usage of the software component.
ja_jp: 最終レビューは、通常、監査チームまたはオープン ソース レビュー ボード (OSRB) の対面での会議で行われ、この会議で、チームはソフトウェア コンポーネントの使用を承認または却下します。

source: The team bases its decision on the complete compliance record of the software component, which includes the following:
ja_jp: チームの決定は、ソフトウェア コンポーネントの完全なコンプライアンス レコードに基づいて行われますが、これには以下が含まれます。

source: ・A source code scan report generated by the scanning tool.
ja_jp: ・スキャン ツールによって生成されたソース コード スキャン レポート。

source: ・The list of discovered issues, information on how they were resolved, and who verified that these issues were successfully resolved.
ja_jp: ・発見された問題のリスト、どのように解決されたかの情報、およびこれらの問題が適切に解決されたことを誰が検証したか。

source: ・Architectural diagrams and information on how this software component interacts with other software components.
ja_jp: ・アーキテクチャ概略図、および対象ソフトウェア コンポーネントが他のソフトウェア コンポーネントとどのようにやり取りするかの情報。

source: ・Legal opinion on compliance, and decision on incoming and outgoing licenses.
ja_jp: ・コンプライアンスに関する法務専門家の意見、および使用ライセンスと被使用ライセンスに関する決定。

source: ・Dynamic and static linkage analysis, if applicable in an embedded environment (C/C++).
ja_jp: ・組み込み環境 (C/C++) で該当する場合、動的および静的リンケージ分析。

source: In most cases, if a software component reaches the final review, it will be approved unless a condition has presented itself (such as the software component is no longer in use).
ja_jp: ほとんどの場合、最終レビューに到達したソフトウェア コンポーネントは、何らかの条件が見つからない限り (ソフトウェア コンポーネントが使用されなくなった場合など)、承認されます。

source: Once approved, the compliance officer will prepare the list of license obligations for the approved software component and pass it to appropriate departments for fulfillment.
ja_jp: 承認されると、コンプライアンス オフィサーは、承認されたソフトウェア コンポーネントのライセンス義務のリストを作成して適切な部門に渡し、義務を履行させます。

source: This can include:
ja_jp: これには、以下が含まれます。

source: ・Updating the software inventory to reflect that the specific OSS software component version x is approved for usage in product y, version z.
ja_jp: ・特定の OSS ソフトウェア コンポーネントのバージョン x を製品 y のバージョン z で使用することが承認されたことを反映するように、ソフトウェア目録を更新します。

source: ・Issuing a ticket to the documentation team to update end user notices in the product documentation, to reflect that open source is being used in the product or service.
ja_jp: ・製品またはサービスでオープン ソースが使用されていることを反映するように製品ドキュメントのエンド ユーザー向け通知を更新するために、チケットをドキュメント製作チームに発行します。

source: ・Triggering the distribution process before the product ships.
ja_jp: ・製品出荷前に配布プロセスを開始します。

source: Steps accomplished after the OSRB approval
ja_jp: OSRB 承認後に実施される手順

source: The compliance officer tracks all open tickets and ensures their completion by the time the product ships or service launches.
ja_jp: コンプライアンス オフィサーは、すべてのオープンなチケットを追跡し、製品出荷時またはサービス開始時までに完了するようにします。

source: For a more detailed usage process and possible scenarios, see our ebook Open Source Compliance in the Enterprise.
ja_jp: 詳細な利用プロセスと想定されるシナリオについては、電子書籍「企業におけるオープン ソース コンプライアンス」を参照してください。

source: Section 5
ja_jp: セクション 5

source: Initial compliance, also called baseline compliance, happens when development starts, and continues until the release of the first version of the product.
ja_jp: 最初のコンプライアンス (ベースライン コンプライアンスとも呼ばれる) は、開発が開始された時点で発生し、製品の最初のバージョンのリリースまで継続します。

source: The compliance team identifies all open source code included in the software baseline, and drives all of the source components through the five-stage approval process outlined above.
ja_jp: コンプライアンス チームは、ソフトウェア ベースラインに含まれるすべてのオープン ソース コードを特定し、すべてのソース コンポーネントに対して上述の 5 段階の承認プロセスを完了させます。

source: “It’s important to remember that open source compliance doesn’t stop with version 1.0.”
ja_jp: 「オープン ソース コンプライアンスはバージョン 1.0 で終了ではないことをしっかりと覚えておいてください。」

source: You will also need to develop an incremental compliance process to check in on the source code once the product ships.
ja_jp: 製品出荷後は、ソース コードをチェックする増分コンプライアンス プロセスを開発する必要があります。

source: This process starts when development begins on a new branch that includes additional features and/or bug fixes.
ja_jp: このプロセスは、追加機能やバグ修正などを含む新しいブランチに関する開発が始まったときに開始されます。

source: Incremental compliance is the process by which compliance is maintained when product features are added to the baseline version 1.0.
ja_jp: 増分コンプライアンスは、製品の機能がベースライン バージョン 1.0 に追加されたときにコンプライアンスを維持するためのプロセスです。

source: Incremental Compliance
ja_jp: 増分コンプライアンス

source: Incremental compliance requires a comparatively smaller effort as opposed to the efforts involved in establishing baseline compliance.
ja_jp: 増分コンプライアンスは、ベースライン コンプライアンスの確立に必要な労力と比べると、比較的手間がかかりません。

source: But several challenges can arise.
ja_jp: しかし、いくつかの問題が生じる可能性があります。

source: You must correctly identify the source code that changed between version 1.0 and version 1.1, and verify compliance on the delta between the releases:
ja_jp: バージョン 1.0 とバージョン 1.1 の間で変更されたソース コードを正確に特定し、リリース間の次のような差分についてコンプライアンスを検証する必要があります。

source: ・New software components may have been introduced.
ja_jp: ・新しいソフトウェア コンポーネントが導入されている可能性があります。

source: ・Existing software components may have been retired.
ja_jp: ・既存のソフトウェア コンポーネントが廃止されている可能性があります。

source: ・Existing software components may have been upgraded to a newer version.
ja_jp: ・既存のソフトウェア コンポーネントが新しいバージョンにアップグレードされている可能性があります。

source: ・The license on a software component may have changed between versions.
ja_jp: ・ソフトウェア コンポーネントのライセンスがバージョン間で変更されている可能性があります。

source: ・Existing software components may have code changes involving bug fixes or changes to functionality and architecture.
ja_jp: ・既存のソフトウェア コンポーネントで、バグ修正や機能/アーキテクチャの変更に伴うコード変更が行われている可能性があります。

source: The obvious question is: How can we keep track of all of these changes?
ja_jp: 当然の疑問として、このような変更のすべてを追跡し続けるにはどうすればいいでしょうか？

source: The answer is simple: a bill of material difference tool (BOM diff tool).
ja_jp: 答えは簡単です。部品表比較ツール (BOM 比較ツール) の利用です。

source: Given the BOM for product v1.1 and the BOM for v1.0, we compute the delta and the output of the tool is the following:
ja_jp: バージョン 1.1 の製品の BOM とバージョン 1.0 の製品の BOM がある場合、ツールを使用すると、差分を計算して以下を出力できます。

source: ・Names of new software components added in v1.1
ja_jp: ・バージョン 1.1 で追加された新しいソフトウェア コンポーネントの名前

source: ・Names of updated software components
ja_jp: ・更新されたソフトウェア コンポーネントの名前

source: ・Names of retired software components
ja_jp: ・廃止されたソフトウェア コンポーネントの名前

source: With this information in hand, achieving incremental compliance becomes a relatively easy task:
ja_jp: この情報を入手できれば、増分コンプライアンスの実現は比較的容易な作業になります。

source: ・Enter new software components into the five-phase usage approval process.
ja_jp: ・新しいソフトウェア コンポーネントを 5 段階の利用承認プロセスに投入します。

source: ・Compute a line-by-line diff of the source code in changed software components, and decide if you want to scan the source code again or rely on the previous scan.
ja_jp: ・変更されたソフトウェア コンポーネントのソース コードの差分を 1 行ごとに計算し、ソース コードを再度スキャンするか、以前のスキャンを信頼するかを決定します。

source: ・Update the software registry by removing the software components that are not used anymore.
ja_jp: ・使用されなくなったソフトウェア コンポーネントを削除して、ソフトウェア レジストリを更新します。

source: The diagram, below, provides an overview of the incremental compliance process.
ja_jp: 下の図に、増分コンプライアンス プロセスの概要を示します。

source: The BOM file for each product release is stored on the build server.
ja_jp: 各製品リリースの BOM ファイルはビルド サーバーに保存されます。

source: The BOM diff tool takes two BOM files as input, each corresponding to a different product release, and computes the delta to produce a list of changes as previously discussed.
ja_jp: BOM 比較ツールは、それぞれが異なる製品リリースに対応する 2 つの BOM ファイルを入力として使用して、差分を計算し、前述の変更リストを作成します。

source: At this point, the compliance officer will create new compliance tickets for all new software components in the release, update compliance tickets where source code has changed and possibly re-pass them through the process, and finally update the software registry to remove retired software components from the approved list.
ja_jp: この段階でコンプライアンス オフィサーは、当該リリースのすべての新しいソフトウェア コンポーネントに対して新しいコンプライアンス チケットを作成し、変更されたソース コードについてはコンプライアンス チケットを更新し、場合によってはプロセスを再度通過させ、最後に、ソフトウェア レジストリを更新することにより、廃止されたソフトウェア コンポーネントを承認リストから削除します。

source: Example of Incremental compliance process
ja_jp: 増分コンプライアンス プロセスの例

source: Open source usage request form
ja_jp: オープン ソース利用申請フォーム

source: Completing the open source usage request form is an important step when developers bring open source software into your company, and should be taken very seriously.
ja_jp: オープン ソース利用申請フォームの記入は、開発者がオープン ソース ソフトウェアを企業に持ち込む際の重要なステップで、慎重に行う必要があります。

source: Developers fill out the online form requesting approval to use a given open source component.
ja_jp: 開発者は、特定のオープン ソース コンポーネントを使用する承認を求めるオンライン フォームに入力します。

source: The form comprises several questions that will provide necessary information for the auditing team or open source review board, allowing it to approve or disapprove the usage of the proposed open source component.
ja_jp: このフォームはいくつかの質問で構成されており、監査チームまたはオープン ソース レビュー ボードは、これらの質問から得られる情報により、提案されたオープン ソース コンポーネントの使用を承認するかどうかを決定することができます。

source: The table, below, highlights the information requested in an open source usage request form.
ja_jp: 次の表に、オープン ソース利用申請フォームで入力を求められる情報を示します。

source: Usually, these values are chosen from a pull-down menu to make the data entry efficient.
ja_jp: 通常、これらの値はプルダウン メニューから選択できるため、データを効率よく入力できます。

source: There are several rules governing the OSRB usage form, for instance:
ja_jp: OSRB 利用フォームに関しては、次のようないくつかの規則があります。

source: ・The form applies only to the usage of open source in a specific product and in a specific context.
ja_jp: ・フォームは、特定の製品および特定のコンテキストでのオープン ソースの利用に限定して適用されます。

source: It is not a general approval of the open source component for all use cases in all products.
ja_jp: すべての製品のすべてのユースケースについて、オープン ソース コンポーネントの一般的な承認を申請するためのものではありません。

source: ・The form is the basis of audit activity and provides information the review team needs to verify if the implementation is consistent with the usage plan expressed in the form, and with the audit and architectural review results.
ja_jp: ・フォームは監査活動の基礎です。レビュー チームは、実装がフォームで示されている利用計画や監査およびアーキテクチャ レビューの結果と一致しているかどうかを検証するために、フォームによって提供される情報を必要とします。

source: ・The form must be updated and re-submitted whenever the usage plans for that specific open source component changes.
ja_jp: ・当該オープン ソース コンポーネントの利用計画が変更された場合は必ず、フォームを更新して再提出する必要があります。

source: ・The auditing team or review board must approve the form before engineering integrates the open source into the product build.
ja_jp: ・エンジニアリング担当者がオープン ソースを製品ビルドに統合する前に、監査チームまたはレビュー ボードがフォームを承認する必要があります。

source: ・The open source executive committee must approve the usage of any open source package where licensing terms require granting a patent license or patent non-assertion.
ja_jp: ・オープン ソース執行委員会は、ライセンス条項が特許ライセンスの付与または特許の非係争を要求しているすべてのオープン ソース パッケージについて、使用を承認する必要があります。

source: Section 6
ja_jp: セクション 6

source: Section 7
ja_jp: セクション 7

source: Open source compliance is an essential part of the software development process.
ja_jp: オープン ソース コンプライアンスは、ソフトウェアの開発プロセスに不可欠のものです。

source: If you use open source software in your product(s) and you do not have a solid compliance program, then you should consider this guide as a call to action.
ja_jp: 製品でオープン ソース ソフトウェアを使用しているにも関わらず、強固なコンプライアンス プログラムがない場合は、ぜひこのガイドをきっかけとして行動を起こしてください。

source: At its core, open source compliance consists of a set of actions that control the intake and distribution of open source used in commercial products.
ja_jp: 本質的に、オープン ソース コンプライアンスは、商品で使用されるオープン ソースの取り込みと配布を管理する一連の活動で構成されます。

source: The result of compliance due diligence is an identification of all open source used in the product (components and snippets) and a plan to meet the license obligations.
ja_jp: コンプライアンスのデュー デリジェンス (適正評価) の結果、製品で使用されるすべてのオープン ソース (コンポーネントおよびスニペット) が特定され、ライセンス義務の履行計画が策定されます。

source: For a detailed guide to open source compliance download our free ebook, Open Source Compliance in the Enterprise by Ibrahim Haddad.
ja_jp: オープン ソース コンプライアンスに関する詳細なガイドについては、無料の電子書籍「企業におけるオープン ソース コンプライアンス」(Ibrahim Haddad 著) をダウンロードしてください。

source: Section 8
ja_jp: セクション 8

source: An architectural diagram, used in the architecture review phase of the open source review process, illustrates the interactions between the various software components in an example platform.
ja_jp: オープン ソース レビュー プロセスのアーキテクチャ レビュー段階で使用されるアーキテクチャ概略図に、プラットフォーム内のさまざまなソフトウェア コンポーネント間の相互作用を示します。

source: Here is an example architectural diagram that shows:
ja_jp: 以下のアーキテクチャ概略図サンプルでは、次のものが示されています。

source: ・Module dependencies
ja_jp: ・モジュールの依存関係

source: ・Open source components (modified versus as-is)
ja_jp: ・オープン ソース コンポーネント (変更されたものと元のままのもの)

source: ・Dynamic versus static linking
ja_jp: ・動的リンクと静的リンク

source: ・Kernel space versus user space
ja_jp: ・カーネル空間とユーザー空間

source: ・Shared header files
ja_jp: ・共有ヘッダー ファイル

source: ・Other open source components that the software component in question interacts or depends on, especially if it is governed by a different open source license
ja_jp: ・特に、対象となっているソフトウェア コンポーネントが別のオープン ソース ライセンスによって管理されている場合、そのコンポーネントがやり取りするまたは依存する、その他のオープン ソース コンポーネント

source: This template for an architectural diagram applies to an embedded environment that relies on C or C++.
ja_jp: このアーキテクチャ概略図のテンプレートは、C または C++ に依存する組み込み環境に適用されます。

source: These resources were created in partnership with the TODO (Talk Openly, Develop Openly) Group – the professional open source networking group at The Linux Foundation.
ja_jp: これらのリソースは、Linux Foundation のプロフェッショナルなオープン ソース ネットワーク グループである TODO (Talk Openly, Develop Openly) グループと協力して作成されました。

source: A special thanks goes out to the open source program managers who contributed their time and knowledge to making these comprehensive guides.
ja_jp: これらの包括的なガイドの作成に時間と知識を提供してくださったオープン ソース プログラム マネージャーの皆様に感謝いたします。

source: Participating companies include Autodesk, Comcast, Dropbox, Facebook, Google, Intel, Microsoft, Netflix, Oath (Yahoo + AOL), Red Hat, Salesforce, Samsung and VMware.
ja_jp: 参加企業は次のとおりです。Autodesk、Comcast、Dropbox、Facebook、Google、Intel、Microsoft、Netflix、Oath (Yahoo + AOL)、Red Hat、Salesforce、Samsung、VMware。

source: To learn more, visit: todogroup.org
ja_jp: 詳細については、次のサイトにアクセスしてください。todogroup.org

source: This work is licensed under a Creative Commons Attribution ShareAlike 4.0 International License.
ja_jp: この文書は、クリエイティブ・コモンズ表示 - 継承 4.0 国際ライセンスの下でライセンスされています。

source: Sign up to get updates!
ja_jp: 登録して最新情報を入手してください。

source: Be the first to know when we add more open source guides and other content like this.
ja_jp: オープン ソース ガイドや他の同様のコンテンツの追加情報をいち早くお届けします。

source: First Name
ja_jp: 名

source: Last Name
ja_jp: 姓

source: Business Email
ja_jp: 勤務先電子メール

source: SUBSCRIBE NOW »
ja_jp: 今すぐ購読する »

source: The contents of this form are subject to The Linux Foundation's Privacy Policy.
ja_jp: このフォームの内容は、Linux Foundation のプライバシー ポリシーの対象となります。
